OpenNuvoton/NUC131BSP/SampleCode/RegBased/CAN_Test_MaskFilter/main.c
        /* Call CAN_SetTxMsgObj() only Configure Msg RAM */
        if(SetTxMsgObj(tCAN, MSG(1), &tMsg) < 0)
        {
            printf("Set Tx Msg Object failed\n");
            return;
        }

        /* Set transmit request bit */
        SetTxRqst(tCAN, MSG(1));

//        /* Check the message has been successfully transmitted */
//        while((tCAN->STATUS & CAN_STATUS_TXOK_Msk) == 0);
//        /* Clear TXOK flag */
//        tCAN->STATUS &= ~CAN_STATUS_TXOK_Msk;

        /* Generate the Delay Time by Systick */
        CLK_SysTickDelay(100000);

        i32id++;
        if(i32id >= 0x10)
            break;

    }
    printf("\nCheck the receive host received data\n");

}

/*---------------------------------------------------------------------------------------------------------*/
/* MAIN function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
int main(void)
{
    CAN_T *tCAN;
    tCAN = (CAN_T *) CAN0;

    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, IP clock and multi-function I/O */
    SYS_Init();

    /* Lock protected registers */
    SYS_LockReg();

    /* Init UART0 for printf */
    UART0_Init();

    /*---------------------------------------------------------------------------------------------------------*/
    /* SAMPLE CODE                                                                                             */
    /*---------------------------------------------------------------------------------------------------------*/

    /* Some description about how to create test environment */
    NoteConfigure();

    /* Configuring the Bit Timing */
    SelectCANSpeed(tCAN);

    /* Test Menu */
    TestItem();

    printf("Test Mask Filter\n\n");
    printf("Please confirm [CAN_Set_MaskFilter] of receiver is selected.\n");
    printf("Press any key to continue ...\n\n");
    GetChar();

    /* Use Message Object No.1 to send ID=0x700~0x70F */
    TestMaskFilter(tCAN);

    /* Disable CAN */
    StopCAN();

    while(1);

}



